

const stations = 
{
    // الخط الأول (حلوان - المرج الجديدة)
    "حلوان" : ["عين حلوان"],
    "عين حلوان" : [ "حلوان","جامعة حلوان"],
    "جامعة حلوان" : ["عين حلوان","وادي حوف"],
    "وادي حوف" : ["جامعة حلوان", "حدائق حلوان"],
    "حدائق حلوان" : ["وادي حوف", "المعصرة"],
    "المعصرة" : ["حدائق حلوان", "طرة الأسمنت"],
    "طرة الأسمنت" : ["المعصرة", "كوتسيكا"],
    "كوتسيكا" : ["طرة الأسمنت", "طرة البلد"],
    "طرة البلد" : ["كوتسيكا", "ثكنات المعادي"],
    "ثكنات المعادي" : ["طرة البلد", "المعادي"],
    "المعادي" : ["ثكنات المعادي", "حدائق المعادي"],
    "حدائق المعادي" : ["المعادي", "دار السلام"],
    "دار السلام" : ["حدائق المعادي", "الزهراء"],
    "الزهراء" : ["دار السلام", "مار جرجس"],
    "مار جرجس" : ["الزهراء", "الملك الصالح"],
    "الملك الصالح" : ["مار جرجس", "السيدة زينب"],
    "السيدة زينب" : ["الملك الصالح", "سعد زغلول"],
    "سعد زغلول" : ["السيدة زينب", "السادات"],
    "السادات" : ["الأوبرا","سعد زغلول", "جمال عبد الناصر", "محمد نجيب"], // محطة تبادلية مع الخط الثاني
    "جمال عبد الناصر" : ["العتبة", "ماسبيرو","السادات", "أحمد عرابي"], // محتاج اضيف الخط التالت
    "أحمد عرابي" : ["جمال عبد الناصر", "الشهداء"],
    "الشهداء" : ["مسرة","أحمد عرابي", "غمرة", "العتبة"], // محطة تبادلية مع الخط الثاني والثالث
    "غمرة" : ["الشهداء", "الدمرداش"],
    "الدمرداش" : ["غمرة", "منشية الصدر"],
    "منشية الصدر" : ["الدمرداش", "كوبري القبة"],
    "كوبري القبة" : ["منشية الصدر", "حمامات القبة"],
    "حمامات القبة" : ["كوبري القبة", "سراي القبة"],
    "سراي القبة" : ["حمامات القبة", "حدائق الزيتون"],
    "حدائق الزيتون" : ["سراي القبة", "حلمية الزيتون"],
    "حلمية الزيتون" : ["حدائق الزيتون", "المطرية"],
    "المطرية" : ["حلمية الزيتون", "عين شمس"],
    "عين شمس" : ["المطرية", "عزبة النخل"],
    "عزبة النخل" : ["عين شمس", "المرج"],
    "المرج" : ["عزبة النخل", "المرج الجديدة"],
    "المرج الجديدة" : ["المرج"],

    // الخط الثاني (شبرا الخيمة - المنيب)
    "شبرا الخيمة" : ["كلية الزراعة"],
    "كلية الزراعة" : ["شبرا الخيمة", "المظلات"],
    "المظلات" : ["كلية الزراعة", "الخلفاوي"],
    "الخلفاوي" : ["المظلات", "سانت تريزا"],
    "سانت تريزا" : ["الخلفاوي", "روض الفرج"],
    "روض الفرج" : ["سانت تريزا", "مسرة"],
    "مسرة" : ["روض الفرج", "الشهداء"],
    "العتبة" : ["باب الشعرية", "الشهداء", "محمد نجيب", "جمال عبد الناصر"], // محطة تبادلية مع الخط الثاني
    "محمد نجيب" : ["العتبة", "السادات"],
    "الأوبرا" : ["السادات", "الدقي"],
    "الدقي" : ["البحوث", "الأوبرا"],
    "البحوث" : ["بولاق الدكرور","جامعه القاهره", "الدقي"],
    "جامعه القاهره" : ["الدقي", "فيصل"],
    "فيصل" : ["جامعه القاهره", "محطة الجيزة"],
    "محطة الجيزة" : ["فيصل", "أم المصريين"],
    "أم المصريين" : ["محطة الجيزة", "ساقية مكي"],
    "ساقية مكي" : ["أم المصريين", "المنيب"],
    "المنيب" : ["ساقية مكي"],

    // الخط الثالث (عدلي منصور - الكيت كات)
    "عدلي منصور" : ["الهايكستب"],
    "الهايكستب" : ["عدلي منصور", "عمر بن الخطاب"],
    "عمر بن الخطاب" : ["الهايكستب", "قباء"],
    "قباء" : ["عمر بن الخطاب", "هشام بركات"],
    "هشام بركات" : ["قباء", "النزهة"],
    "النزهة" : ["هشام بركات", "نادي الشمس"],
    "نادي الشمس" : ["النزهة", "ألف مسكن"],
    "ألف مسكن" : ["نادي الشمس", "ميدان هليوبوليس"],
    "ميدان هليوبوليس" : ["ألف مسكن", "هارون"],
    "هارون" : ["ميدان هليوبوليس", "الأهرام"],
    "الأهرام" : ["هارون", "كلية البنات"],
    "كلية البنات" : ["الأهرام", "الاستاد"],
    "الاستاد" : ["كلية البنات", "أرض المعارض"],
    "أرض المعارض" : ["الاستاد", "العباسية"],
    "العباسية" : ["أرض المعارض", "عبده باشا"],
    "عبده باشا" : ["العباسية", "الجيش"],
    "الجيش" : ["عبده باشا", "باب الشعرية"],
    "باب الشعرية" : ["الجيش", "العتبة"], // محطة تبادلية مع الخط الثاني
    "ماسبيرو" : ["جمال عبد الناصر", "صفاء حجازي"],
    "صفاء حجازي" : ["ماسبيرو", "الكيت كات"],

    "الكيت كات" : ["التوفيقية","صفاء حجازي","السودان"], // المحطة الحالية مع المحطات المستقبلية
    "السودان" : ["الكيت كات", "إمبابة"], // تحت الإنشاء
    "إمبابة" : ["السودان", "البوهي"], // تحت الإنشاء
    "البوهي" : ["إمبابة", "القومية العربية"], // تحت الإنشاء
    "القومية العربية" : ["البوهي", "الطريق الدائري"], // تحت الإنشاء
    "الطريق الدائري" : ["القومية العربية", "محور روض الفرج"], // تحت الإنشاء
    "محور روض الفرج" : ["الطريق الدائري",], // تحت الإنشاء
    
    "التوفيقية" : ["وادي النيل","الكيت كات"],
    "وادي النيل" : ["جامعه الدول العربيه","التوفيقية"],
    "جامعه الدول العربيه" : ["وادي النيل","بولاق الدكرور"],
    "بولاق الدكرور" : ["جامعه القاهره","جامعه الدول العربيه"],
};


const findNearestStation = (currentStation, destination)=>{

    const queue = [currentStation];
    let counter = 0;
    let i;
    let visited = new Set();
    visited.add(currentStation);
    while (!queue.includes(destination)){

        counter++;
        i = queue.length;
        while (i){
            stations[queue.shift()].map(s => {
                if (!queue.includes(s) && !visited.has(s)){
                    queue.push(s);
                    visited.add(s);
                }

            })
            i--;
        }

    }

    console.log(counter);


}


findNearestStation("عدلي منصور", "المعادي")